Revit 2026 API

# IConnectorDomain Property

---

The domain of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
Domain Domain { get; }
```
```vb
ReadOnly Property Domain As Domain
	Get
```
```cpp
property Domain Domain {
	Domain get ();
}
```
```fsharp
abstract Domain : Domain with get
```

#### Property Value

Domain

This property is used to retrieve the domain of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace